src/test/resources/org/lockss/ws/importer/getSupportedChecksumAlgorithmsRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/ImportService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://importer.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:getSupportedChecksumAlgorithms>
        </service:getSupportedChecksumAlgorithms>
    </soapenv:Body>
</soapenv:Envelope>
